test/performance/load-test.yml
config:
  target: 'ws://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./load-test-processor.js"

scenarios:
  - name: "WebSocket Chat Load Test"
    engine: "ws"
    flow:
      - send:
          payload: '{"type":"login","username":"loadtest_{{ $randomString()}}","password":"test123"}'
      - think: 2
      - loop:
        - send:
            payload: '{"type":"chat","content":"Load test message {{ $randomNumber(1, 1000) }}","roomId":"global"}'
        - think: 5
        count: 10
      - send:
          payload: '{"type":"typing","isTyping":true}'
      - think: 2
      - send:
          payload: '{"type":"typing","isTyping":false}'
      - think: 3
      - send:
          payload: '{"type":"logout"}'

  - name: "Heavy Message Traffic"
    engine: "ws"
    weight: 30
    flow:
      - send:
          payload: '{"type":"login","username":"heavy_{{ $randomString() }}","password":"test123"}'
      - think: 1
      - loop:
        - send:
            payload: '{"type":"chat","content":"Heavy traffic msg {{ $randomNumber(1, 10000) }}","roomId":"global"}'
        - think: 1
        count: 50

  - name: "Room Operations"
    engine: "ws"
    weight: 20
    flow:
      - send:
          payload: '{"type":"login","username":"room_{{ $randomString() }}","password":"test123"}'
      - think: 2
      - send:
          payload: '{"type":"create_room","name":"LoadTest Room {{ $randomNumber(1, 100) }}"}'
      - think: 3
      - send:
          payload: '{"type":"get_rooms"}'
      - think: 2
      - loop:
        - send:
            payload: '{"type":"chat","content":"Room message {{ $randomNumber(1, 1000) }}","roomId":"room_id"}'
        - think: 3
        count: 5

  - name: "Concurrent Connections"
    engine: "ws"
    weight: 15
    flow:
      - send:
          payload: '{"type":"login","username":"concurrent_{{ $randomString() }}","password":"test123"}'
      - think: 30
      - send:
          payload: '{"type":"get_online_users"}'
      - think: 10
      - send:
          payload: '{"type":"logout"}'